#include <stdio.h>


int main()
{
    double d;
    float  f;

    printf("Dwse enan arithmo double: ");
    scanf("%lf", &d);

    f = (float) d;

    printf("d = %.12lf\n", d);
    printf("f = %.12f\n",  f);

    return 0;
}

/*
    Ερώτηση  :

        κτελέστε το παραπάνω πρόγραμμα δίνοντας για d την τιμή 1.123. Μετά, εκτελέστε
        το παραπάνω πρόγραμμα δίνοντας για d την τιμή 1.123456789123. Τί παρατηρείτε;

    Απάντηση :

        double d → 64-bit (πολύ μεγάλη ακρίβεια)
        float f → 32-bit (μικρότερη ακρίβεια, ~7 δεκαδικά σημαντικά ψηφία)

        1. d = 1.123

            d = 1.123000000000
            f = 1.123000025749

        2. d = 1.123456789123

            Το double κρατάει ~15–17 δεκαδικά σημαντικά ψηφία
            Το float κρατάει ~6–7 δεκαδικά σημαντικά ψηφία

            d = 1.123456789123
            f = 1.123456835747 (αρκετα μεγαλη αποκλιση)
*/
